app/views/finished_jobs/index.html.erb

SELECT  "job_types".* FROM "job_types" WHERE "job_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
				<tr>
					<td><%= JobType.find(accepted.job.job_type_id).name %></td>
					<td><%= accepted.teenager.firstname %> <%= accepted.teenager.lastname %></td>