app/views/finished_jobs/my_finished_jobs.html.erb

SELECT  "job_types".* FROM "job_types" WHERE "job_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
						<% the_job = Job.find(fin.job_id) %>
						<td><%= JobType.find(fin.job.job_type_id).name %>:</td>
						<td><%= fin.teenager.firstname %> <%= fin.teenager.lastname %></td>