app/views/finished_jobs/new.html.erb

	            		<% if(@user.usertype == 0) %>
	            			<% if(ApplyJob.where("job_id = ? AND teenager_id = ?", @job.id, Teenager.find_by_user_id(@user.id).id).first == nil) %>
---
SELECT  "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

	           		<div class="col-md-3 emphasis" style="padding: 5px">
	           			<% if((@user.usertype == 0 && @job.teenager_id == Teenager.find_by_user_id(@user.id).id) || (@user.usertype == 1 && @job.client_id == Client.find_by_user_id(@user.id).id)) %>
---
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = 2 LIMIT ?  [["LIMIT", 1]]