prj/app/controllers/addresses_controller.rb

def index
	@user = User.find(params[:user_id])
	@addresses = @user.address.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ?  [["user_id", 1]]

def show
	@address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def new
	@user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def edit
	@user = User.find(params[:user_id])
	@address = @user.address.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? AND "addresses"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

def create
	@user = User.find(params[:user_id])
	@user.address.create!(address_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "addresses" ("street_no", "street", "apt_no", "postalcode", "city", "province", "address_type", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def update
	@address = Address.find(params[:id])

	if @address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "street_no" = ?, "street" = ?, "apt_no" = ?, "postalcode" = ?, "city" = ?, "province" = ?, "address_type" = ?, "updated_at" = ? WHERE "addresses"."id" = ?

def destroy

	@user = User.find(params[:user_id])
	@address = Address.find(params[:id])
	@address.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]