prj/app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients"
---
	def index
	  @users = User.all
	  @clients = Client.all

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 12], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def show
		@user = current_user
		@client = Client.find_by(user_id: current_user.id)
	  	@jobs = Job.where(client_id: @client.id).order("created_at DESC").limit(3)
    	@transactions = Transaction.where(client_id: @client.id).order(trans_date: :desc).limit(3)
		@rating_coll = Job.where("client_id = ? AND cancelled = ? AND finished = ?", @client.id, false, true)

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 12], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "clients" SET "fName" = ?, "lName" = ?, "gender" = ?, "birth_month" = ?, "birth_day" = ?, "birth_year" = ?, "address" = ?, "apt_no" = ?, "city" = ?, "province" = ?, "country" = ?, "postal_code" = ?, "updated_at" = ? WHERE "clients"."id" = ?
---
	def update
        if current_user.usertype != 2
            @user = current_user
            @client = @user.client
        else
            @user = User.find(params[:user_id])
            @client = @user.client
        end

        if @client.update(client_params)