prj/app/controllers/jobs_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
def show
	@user = current_user
	@job = Job.find(params[:id])
  	@client = Client.find_by(id: @job.client_id)

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
def create
	@user = current_user
	# Ensure user is a client
	if @user.usertype==0
		flash[:error] = "Teenagers cannot create a new job"
		redirect_to root_path
	end
	params[:job][:client_id] = Client.find_by_user_id(current_user.id).id