prj/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "tneizn@gmail.com"], ["LIMIT", 1]]
---
  def create
  	user = User.find_by(username: params[:session][:username])