prj/app/controllers/teenagers_controller.rb

    def show
        @user = current_user
        @teenager = Teenager.find_by(user_id: current_user.id)
        @jobs = Job.where(teenager_id: @teenager.id).order("created_at DESC").limit(3)
        @endorsements = Endorsement.where(end_user_id: current_user.id).all
        if @endorsements
            @end_count = @endorsements.count
        end
        @transactions = Transaction.where(teenager_id: @teenager.id).order(trans_date: :desc).limit(3)
        @rating_coll = Job.where("teenager_id = ? AND cancelled = ? AND finished = ?", @teenager.id, false, true)
---
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]