prj/app/controllers/teenagers_controller.rb

SELECT "teenagers".* FROM "teenagers"
---
    def index
        @teenagers = Teenager.all