prj/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
def show
  @user = User.find(params[:id])

INSERT INTO "users" ("username", "password", "usertype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "lajflaj@lsjfljlsjfl"], ["password", "10i0922edsfl;jf"], ["usertype", 1], ["created_at", "2017-10-21 20:36:06.150415"], ["updated_at", "2017-10-21 20:36:06.150415"]]
---
def create
  @user = User.new(user_params)

  if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "usertype" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["usertype", 0], ["updated_at", "2017-10-10 03:05:08.963948"], ["id", 1]]
---
def update
  @user = User.find(params[:id])

  if @user.update(user_params)