prj/app/controllers/users/registrations_controller.rb

  def create
    super
    @user = User.find(current_user.id)
    @user.username = params[:user][:email]
    @user.usertype = params[:user][:usertype]
    @user.save

    if @user.usertype == 0
      @teenager = Teenager.new
      @teenager.user_id = @user.id
      @teenager.save(validate: false)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "sign_in_count" = ?, "current_sign_in_at" = ?, "last_sign_in_at" = ?, "current_sign_in_ip" = ?, "last_sign_in_ip" = ? WHERE "users"."id" = ?
INSERT INTO "users" ("created_at", "updated_at", "email", "encrypted_password") VALUES (?, ?, ?, ?)