app/views/search/search.html.erb

					    <tr>
					      <td><%= JobType.find(job.job_type_id).name %></td>
---
SELECT  "job_types".* FROM "job_types" WHERE "job_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]