app/views/jobs/_form.html.erb

    <%= form.label :job_type_id %><br>
    <%= form.select :job_type_id, JobType.all.collect {|job_type| [ job_type.name, job_type.id ]} %>
---
SELECT "job_types".* FROM "job_types"