prj/app/views/jobs/index.html.erb

      <td>Accepted By: <%= job.teenager_id %></td>
      <td>Offered By: <%= Client.find(job.client_id).user.username %></td>
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]