app/views/template/modal/_endorsement.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
                		<% if endorsement.removed != 1 %>
                			<% ref_user = User.find_by(id: endorsement.ref_user_id) %>