app/views/template/nav/_usermenu.html.erb

    <% if(current_user.usertype==0) %>
      <% @teenager = Teenager.find_by_user_id(current_user.id) %>
---
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]


      <% @client = Client.find_by_user_id(current_user.id) %>
---
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]