app/views/template/display/_jobinfo.html.erb

	            		<% if(@user.usertype == 0) %>
	            			<% if(ApplyJob.where("job_id = ? AND teenager_id = ?", @job.id, Teenager.find_by_user_id(@user.id).id).first == nil) %>
---
SELECT  "apply_jobs".* FROM "apply_jobs" WHERE (job_id = 1 AND teenager_id = 5) ORDER BY "apply_jobs"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

	           		<div class="col-md-3 emphasis" style="padding: 5px">
	           			<% if((@user.usertype == 0 && @job.teenager_id == Teenager.find_by_user_id(@user.id).id) || (@user.usertype == 1 && @job.client_id == Client.find_by_user_id(@user.id).id)) %>
---
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]