app/views/template/display/_job_board.html.erb

SELECT  "job_types".* FROM "job_types" WHERE "job_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                  <tr>
                    <td><%= JobType.find(job.job_type_id).name %></td>

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                    <td>
                      <% if(@user.usertype==1 && Client.find(job.client_id).user_id == @user.id || @user.usertype==0) %>