app/views/template/display/_myjobs.html.erb

SELECT  "job_types".* FROM "job_types" WHERE "job_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
																	<%= link_to(job_path(job)) do %>
																		Job Type: <%= JobType.find(job.job_type_id).name %>

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
																</h4>
																<h5>Offered By: <%= Client.find(job.client_id).fName %> <%= Client.find(job.client_id).lName %></h5>