app/views/template/display/_single_application.html.erb

SELECT  "job_types".* FROM "job_types" WHERE "job_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        					<tr>
        							<td><%= JobType.find(@job.job_type_id).name %></td>

SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
        							</td>
        							<td><%= Teenager.find(appl[0]).firstname %> <%= Teenager.find(appl[0]).lastname %></td>

SELECT  "apply_jobs".* FROM "apply_jobs" WHERE (teenager_id = 6 AND job_id = 4) ORDER BY "apply_jobs"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
        								<%= form_with url: accept_jobs_path, local: true do |form| %>
    			            		<%= form.hidden_field :apply_job_id, :value => ApplyJob.where("teenager_id = ? AND job_id = ?", appl[0], @job.id).first.id %>