app/views/template/profile/_client_profile.html.erb

                                            <h4>
                                              <strong><%= JobType.find(job.job_type_id).name %></strong><br/>
---
SELECT  "job_types".* FROM "job_types" WHERE "job_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]