app/controllers/accept_jobs_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "apply_jobs".* FROM "apply_jobs" WHERE (job.client_id = 2 AND filled = 'f' AND job.cancelled = 'f' AND job.finished = 'f' AND job.accepted = 'f')
SELECT "teenagers".* FROM "teenagers" WHERE "teenagers"."id" IN (5, 6)
---
	def index
		@user = current_user
		if(@user.usertype != 1)
			redirect_to root_path
		else
			@client = Client.find_by_user_id(@user.id)
			# @applications = ApplyJob.where("client_id = ? AND filled = false", @client.id).order(:job_id)

			@applications = ApplyJob.includes(:job, :teenager).where("client_id = ? AND filled = ?", @client.id, false)

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "apply_jobs".* FROM "apply_jobs" WHERE (client_id = 2 AND job_id = 4 AND filled = 'f' AND job.cancelled = 'f' AND job.finished = 'f' AND job.accepted = 'f')
SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."end_user_id" = ?  [["end_user_id", 6]]
SELECT "finished_jobs".* FROM "finished_jobs" WHERE "finished_jobs"."teenager_id" = ?  [["teenager_id", 6]]
SELECT COUNT(*) FROM "finished_jobs" WHERE "finished_jobs"."teenager_id" = ?  [["teenager_id", 6]]
---
	def new
		@user = current_user
		if(@user.usertype != 1)
			redirect_to root_path
		end
		@client = Client.find_by_user_id(@user.id)
		@job = Job.find(params[:job])
		@applications = ApplyJob.includes(:job, :teenager).where("client_id = ? AND job_id = ? AND filled = ?", @client.id, @job.id, false)
		@appliers = {}
		@applications.each do | app |
			endCount = Endorsement.where(end_user_id: app.teenager_id).count

			allRatings = FinishedJob.where(teenager_id: app.teenager_id)
			rCount = allRatings.count

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def create
		@user = current_user
		if(@user.usertype != 1)
			redirect_to root_path
		end
		@client = Client.find_by_user_id(@user.id)
		@applied_job = ApplyJob.find(params[:apply_job_id])