app/controllers/apply_jobs_controller.rb

INSERT INTO "apply_jobs" ("job_id", "client_id", "teenager_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["job_id", 1], ["client_id", 2], ["teenager_id", 5], ["created_at", "2017-12-01 04:02:45.225932"], ["updated_at", "2017-12-01 04:02:45.225932"]]
---
	def create
		@current_user = current_user
		@job = Job.find(params[:apply_job])

		@apply_job = ApplyJob.new
		@apply_job.job_id = @job.id
		@apply_job.client_id = @job.client_id
		@apply_job.teenager_id = @current_user.teenager.id

        session[:return_to] ||= request.referer

		if (@apply_job.save)

SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."teenager_id" = ? AND "apply_jobs"."filled" = ? AND "apply_jobs"."winner_id" = ?  [["teenager_id", 5], ["filled", "t"], ["winner_id", 5]]
---
	def index
		@user = current_user
		@teenager_id = @user.teenager.id

		@rewarded_jobs = ApplyJob.where(teenager_id: @teenager_id, filled: true, winner_id: @teenager_id)