app/controllers/clients_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."client_id" = ? ORDER BY "transactions"."trans_date" DESC LIMIT ?  [["client_id", 2], ["LIMIT", 3]]
---
	def show
		@user = current_user
	  @client = Client.find_by(user_id: current_user.id)
	  @jobs = Job.where(client_id: @client.id).order("created_at DESC").limit(3)
    @transactions = Transaction.where(client_id: @client.id).order(trans_date: :desc).limit(3)

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def edit
		if current_user.usertype != 2
            @user = current_user
            @client = Client.find_by(user_id: current_user.id)
        else
            @user = User.find(params[:user_id])

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "clients" SET "address" = ?, "apt_no" = ?, "postal_code" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["address", "34 st george st"], ["apt_no", 5], ["postal_code", "M5S 2E3"], ["latitude", 43.6595597], ["longitude", -79.3968974], ["updated_at", "2017-12-01 05:44:38.373892"], ["id", 2]]
---
	def update
        if current_user.usertype != 2
            @user = current_user
            @client = @user.client
        else
            @user = User.find(params[:user_id])
            @client = @user.client
        end

        if @client.update(client_params)