app/controllers/endorsements_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "endorsements" ("created_at", "updated_at", "ref_user_id", "end_user_id", "skill", "removed") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2017-12-04 02:23:13.042707"], ["updated_at", "2017-12-04 02:23:13.042707"], ["ref_user_id", 2], ["end_user_id", 14], ["skill", "babysitting"], ["removed", 0]]
---
	def create
		@user = User.find(params[:user_id])
		# Insert the current_user into the hash so we can can save it to the database
		params[:endorsement].merge!(:ref_user_id => current_user.id, :removed => 0)

		@endorsement = @user.g_endorsement.create(endorsement_params)