app/controllers/finished_jobs_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = 14 LIMIT ?  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "apply_jobs".* FROM "apply_jobs" WHERE (client_id = 2 AND filled = 't' AND this.teenager_id = this.winner_id)
---
	def index
		@user = current_user
		if (@user.usertype != 1)
			redirect_to root_path
		end

		@client = Client.find_by_user_id(@user)

        # This has to change, i need to differentiate between accpeted jobs and finished jobs
		@accepted_jobs = ApplyJob.where("client_id = ? AND filled = ? AND teenager_id = winner_id", @client.id, true)

SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "finished_jobs".* FROM "finished_jobs" WHERE (client_id = 2)
---
	def my_finished_jobs
		@user = current_user
		if(@user.usertype == 0)
			@teenager = Teenager.find_by_user_id(@user.id)
			@finished_jobs = FinishJob.where("teenager_id = ?", @teenager.id)
		elsif(@user.usertype == 1)
			@client = Client.find_by_user_id(@user.id)
			@finished_jobs = FinishedJob.where("client_id = ?", @client.id)

SELECT  "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "job_types".* FROM "job_types" WHERE "job_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = 2 LIMIT ?  [["LIMIT", 1]]
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def new
		@user = current_user
		@finished_job = ApplyJob.find(params[:finished_job])
		@job = Job.find(@finished_job.job_id)
		@job_type = JobType.find(@job.job_type_id).name

		if (@user.usertype == 0)
			@teenager = Teenager.find_by_user_id(@user)
			@client = Client.find(@finished_job.client_id)
		elsif(@user.usertype == 1)
			@client = Client.find_by_user_id(@user)
			@teenager = Teenager.find(@finished_job.teenager_id)

SELECT  "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = 2 LIMIT ?  [["LIMIT", 1]]
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "finished_jobs" ("job_id", "teenager_id", "client_id", "finish_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["job_id", 1], ["teenager_id", 6], ["client_id", 2], ["finish_time", "2017-12-03 08:37:00.730897"], ["created_at", "2017-12-03 08:37:00.748425"], ["updated_at", "2017-12-03 08:37:00.748425"]]
---
	def create
		@user = current_user
		@finished_job = ApplyJob.find(params[:finished_job][:finished_job_id])

		@job = Job.find(@finished_job.job_id)
		if (@user.usertype == 0)
			@teenager = Teenager.find_by_user_id(@user)
			@job.clients_rating = params[:finished_job][:clients_rating]
			@job.save(:validate => false)
			redirect_to root_path

		elsif(@user.usertype == 1)
			@client = Client.find_by_user_id(@user)
			@teenager = Teenager.find(@finished_job.winner_id)

			@job.teens_rating = params[:finished_job][:teens_rating]
			@job.finished = true
			if(@job.save(:validate => false) == true)
				@actual_finished_job = FinishedJob.new
				@actual_finished_job.job_id = @job.id
				@actual_finished_job.teenager_id = @teenager.id
				@actual_finished_job.client_id = @client.id
				@actual_finished_job.finish_time = Time.now
				@actual_finished_job.save