app/controllers/jobs_controller.rb

def index
	@user = current_user
	@jobs = Job.where("cancelled = ? AND finished = ?", false, false)
	if(@user.usertype==0)
		@teen = Teenager.find_by_user_id(@user.id)
	elsif(@user.usertype==1)
		@client = Client.find_by_user_id(@user.id)
---
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

def clientjobs
	@user = current_user
	@client = Client.find_by(user_id: @user.id)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

def show
	@user = current_user
	@job = Job.find(params[:id])
	@job_name = JobType.find(@job.job_type_id).name
  	@client = Client.find_by(id: @job.client_id)
  	if @client
  		@client_username = User.find(@client.user_id).username
  	end

  	@teenager = Teenager.find_by(id: @job.teenager_id)
  	if @teenager
  		@teenager_username = User.find(@teenager.user_id).username
---
SELECT  "job_types".* FROM "job_types" WHERE "job_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]

def new
	@user = current_user
	@job = Job.new
	@job_types = JobType.all
---
SELECT "job_types".* FROM "job_types"

def edit
	@user = current_user
	@job = Job.find(params[:id])
	@job_types = JobType.all
---
SELECT "job_types".* FROM "job_types"

def create
	@user = current_user
	# Ensure user is a client
	if @user.usertype==0
		flash[:error] = "Teenagers cannot create a new job"
		redirect_to root_path
	end
	params[:job][:client_id] = Client.find_by_user_id(current_user.id).id
---
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]