app/controllers/profiles_controller.rb

	def this_profile
		@this_user = User.find(params[:user_id])



		@user = current_user

	    if @this_user.usertype == 0 #Teenager
	      	@this_teenager = Teenager.find_by(user_id: @this_user.id)
	      	@endorsements = Endorsement.where(end_user_id: @this_user.id, removed: 0).all
	      	if @endorsements
	      		@end_count = @endorsements.count
	      	end
	      	@jobs = Job.where(teenager_id: @this_teenager.id).order("created_at DESC").limit(3)
        	@rating_coll = Job.where("teenager_id = ? AND cancelled = ? AND finished = ?", @this_teenager.id, false, true)
	        # ratings matter only for finished jobs
	        @r_count = @rating_coll.count
	        @r_avg = @rating_coll.average(:teens_rating)
        	if @this_teenager.nil?
	      		redirect_to home_index_url
	      	else
	      		@endorsement = Endorsement.find_by(ref_user_id: @user.id, end_user_id: @this_user.id)
	      		if @endorsement.nil?
					@new_endorsement = @this_user.g_endorsement.new
	      		end
	      		render "profiles/show_teenager"
	    	end

	    elsif @this_user.usertype == 1 #Client
	    	@this_client = Client.find_by(user_id: @this_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."user_id" = ? LIMIT ?  [["user_id", 14], ["LIMIT", 1]]
SELECT "endorsements".* FROM "endorsements" WHERE "endorsements"."end_user_id" = ? AND "endorsements"."removed" = ?  [["end_user_id", 14], ["removed", 0]]
SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."end_user_id" = ? AND "endorsements"."removed" = ?  [["end_user_id", 14], ["removed", 0]]
SELECT  "endorsements".* FROM "endorsements" WHERE "endorsements"."ref_user_id" = ? AND "endorsements"."end_user_id" = ? LIMIT ?  [["ref_user_id", 2], ["end_user_id", 14], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]