app/controllers/search_controller.rb

SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]
---
	def search
		@user = current_user
		if(current_user.usertype == 0)
			@teenager = Teenager.find_by_user_id(@user.id)