app/controllers/teenagers_controller.rb

SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]
SELECT "endorsements".* FROM "endorsements" WHERE "endorsements"."end_user_id" = ?  [["end_user_id", 14]]
SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."end_user_id" = ?  [["end_user_id", 14]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."teenager_id" = ? ORDER BY "transactions"."trans_date" DESC LIMIT ?  [["teenager_id", 6], ["LIMIT", 3]]
---
    def show
        @user = current_user
        @teenager = Teenager.find_by(user_id: current_user.id)
        @endorsements = Endorsement.where(end_user_id: current_user.id).all
        if @endorsements
            @end_count = @endorsements.count
        end
        @transactions = Transaction.where(teenager_id: @teenager.id).order(trans_date: :desc).limit(3)

SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def edit
        if current_user.usertype != 2
            @user = current_user
            @teenager = Teenager.find_by(user_id: current_user.id)
        else
            @user = User.find(params[:user_id])

SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."user_id" = ? LIMIT ?  [["user_id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "teenagers" SET "firstname" = ?, "lastname" = ?, "gender" = ?, "birth_month" = ?, "birth_day" = ?, "birth_year" = ?, "address" = ?, "apt_no" = ?, "city" = ?, "province" = ?, "country" = ?, "postal_code" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "teenagers"."id" = ?
---
    def update
        if current_user.usertype != 2
            @user = current_user
            @teenager = @user.teenager
        else
            @user = User.find(params[:user_id])
            @teenager = @user.teenager
        end

        if @teenager.update(teenager_params)