app/controllers/transactions_controller.rb

	def index
		@user = current_user
		@transactions = nil
		if @user.usertype == 0 # Teenager
			@teenager = Teenager.find_by(user_id: @user.id)
			@transactions = Transaction.where(teenager_id: @teenager.id).order(trans_date: :desc)
		else # Client
			@client = Client.find_by(user_id: @user.id)
			@transactions = Transaction.where(client_id: @client.id).order(trans_date: :desc)
---
SELECT  "teenagers".* FROM "teenagers" WHERE "teenagers"."user_id" = ? LIMIT ?  [["user_id", 9], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."teenager_id" = ? ORDER BY "transactions"."trans_date" DESC  [["teenager_id", 3]]
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."client_id" = ? ORDER BY "transactions"."trans_date" DESC  [["client_id", 2]]