app/controllers/users/registrations_controller.rb

  def create
    super
    @user = User.find(current_user.id)
    @user.username = params[:user][:email]
    @user.usertype = params[:user][:usertype]
    @user.save

    if @user.usertype == 0
      @teenager = Teenager.new
      @teenager.user_id = @user.id
      @teenager.save(validate: false)
    elsif @user.usertype == 1
      @client = Client.new
      @client.user_id = @user.id
      @client.save(validate: false)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "usertype" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "alextest4@mail"], ["usertype", 0], ["updated_at", "2017-11-29 06:24:52.415252"], ["id", 9]]
INSERT INTO "teenagers" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 9], ["created_at", "2017-11-29 06:24:52.588676"], ["updated_at", "2017-11-29 06:24:52.588676"]]
INSERT INTO "users" ("created_at", "updated_at", "email", "encrypted_password") VALUES (?, ?, ?, ?)
INSERT INTO "clients" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 10], ["created_at", "2017-11-30 00:38:25.414671"], ["updated_at", "2017-11-30 00:38:25.414671"]]