app/views/apply_jobs/index.html.erb

      <% job = Job.find(rewarded_job.job_id) %>
      <% client = Client.find(job.client_id) %>

      <h4><%= JobType.find(job.job_type_id).name %> Job for <%= client.fName %> <%= client.lName %></h4>
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "job_types".* FROM "job_types" WHERE "job_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

          <td>End Time: <%= job.finishtime.to_formatted_s(:long) %></td>
          <td>Contact Info: <%= User.find(client.user_id).username %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]